
## :x: Apply Failed (koyashiro.me)

[CI link](https://github.com/koyashiro/infra/actions/runs/8789046397)



<pre><code>Error: expected DNS record to not already be present but already exists

  with cloudflare_record.cname_root,
  on dns_records.tf line 1, in resource &#34;cloudflare_record&#34; &#34;cname_root&#34;:
   1: resource &#34;cloudflare_record&#34; &#34;cname_root&#34; {


Error: expected DNS record to not already be present but already exists

  with cloudflare_record.txt_spf,
  on dns_records.tf line 10, in resource &#34;cloudflare_record&#34; &#34;txt_spf&#34;:
  10: resource &#34;cloudflare_record&#34; &#34;txt_spf&#34; {


Error: expected DNS record to not already be present but already exists

  with cloudflare_record.txt_dkim,
  on dns_records.tf line 18, in resource &#34;cloudflare_record&#34; &#34;txt_dkim&#34;:
  18: resource &#34;cloudflare_record&#34; &#34;txt_dkim&#34; {


Error: expected DNS record to not already be present but already exists

  with cloudflare_record.txt_dmarc,
  on dns_records.tf line 26, in resource &#34;cloudflare_record&#34; &#34;txt_dmarc&#34;:
  26: resource &#34;cloudflare_record&#34; &#34;txt_dmarc&#34; {


Error: expected DNS record to not already be present but already exists

  with cloudflare_record.txt_keybase_site_verification,
  on dns_records.tf line 34, in resource &#34;cloudflare_record&#34; &#34;txt_keybase_site_verification&#34;:
  34: resource &#34;cloudflare_record&#34; &#34;txt_keybase_site_verification&#34; {</code></pre>

<details><summary>Details (Click me)</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.cname_root will be created
  + resource "cloudflare_record" "cname_root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "koyashi.ro"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_dkim will be created
  + resource "cloudflare_record" "txt_dkim" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "*._domainkey"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DKIM1; p="
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_dmarc will be created
  + resource "cloudflare_record" "txt_dmarc" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s;"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_keybase_site_verification will be created
  + resource "cloudflare_record" "txt_keybase_site_verification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "keybase-site-verification=mXW1Jxxi9Cxm_w4TvEv1g3eFJVpm95-i0VCWsxSmr8M"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_spf will be created
  + resource "cloudflare_record" "txt_spf" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=spf1 -all"
      + zone_id         = (sensitive value)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
cloudflare_record.txt_keybase_site_verification: Creating...
cloudflare_record.cname_root: Creating...
cloudflare_record.txt_dkim: Creating...
cloudflare_record.txt_spf: Creating...
cloudflare_record.txt_dmarc: Creating...
cloudflare_record.cname_root: Still creating... [10s elapsed]
cloudflare_record.txt_dkim: Still creating... [10s elapsed]
cloudflare_record.txt_keybase_site_verification: Still creating... [10s elapsed]
cloudflare_record.txt_spf: Still creating... [10s elapsed]
cloudflare_record.txt_dmarc: Still creating... [10s elapsed]
cloudflare_record.txt_dkim: Still creating... [20s elapsed]
cloudflare_record.txt_keybase_site_verification: Still creating... [20s elapsed]
cloudflare_record.cname_root: Still creating... [20s elapsed]
cloudflare_record.txt_dmarc: Still creating... [20s elapsed]
cloudflare_record.txt_spf: Still creating... [20s elapsed]
cloudflare_record.txt_keybase_site_verification: Still creating... [30s elapsed]
cloudflare_record.cname_root: Still creating... [30s elapsed]
cloudflare_record.txt_dkim: Still creating... [30s elapsed]
cloudflare_record.txt_dmarc: Still creating... [30s elapsed]
cloudflare_record.txt_spf: Still creating... [30s elapsed]

Error: expected DNS record to not already be present but already exists

  with cloudflare_record.cname_root,
  on dns_records.tf line 1, in resource "cloudflare_record" "cname_root":
   1: resource "cloudflare_record" "cname_root" {


Error: expected DNS record to not already be present but already exists

  with cloudflare_record.txt_spf,
  on dns_records.tf line 10, in resource "cloudflare_record" "txt_spf":
  10: resource "cloudflare_record" "txt_spf" {


Error: expected DNS record to not already be present but already exists

  with cloudflare_record.txt_dkim,
  on dns_records.tf line 18, in resource "cloudflare_record" "txt_dkim":
  18: resource "cloudflare_record" "txt_dkim" {


Error: expected DNS record to not already be present but already exists

  with cloudflare_record.txt_dmarc,
  on dns_records.tf line 26, in resource "cloudflare_record" "txt_dmarc":
  26: resource "cloudflare_record" "txt_dmarc" {


Error: expected DNS record to not already be present but already exists

  with cloudflare_record.txt_keybase_site_verification,
  on dns_records.tf line 34, in resource "cloudflare_record" "txt_keybase_site_verification":
  34: resource "cloudflare_record" "txt_keybase_site_verification" {


```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":167,"Program":"tfcmt","SHA1":"d9515d6db11c2002c8e66a2e93767088a4432f04","Target":"koyashiro.me","Vars":{},"WorkflowName":"terraform"} -->